; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	spectrograph0 - mode
	spectrograph5 - mode
	image6 - mode
	thermograph1 - mode
	spectrograph2 - mode
	image4 - mode
	infrared3 - mode
	thermograph7 - mode
	Star1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star0 - direction
	GroundStation2 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 infrared3)
	(supports instrument0 thermograph7)
	(supports instrument0 spectrograph5)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star0)
	(supports instrument2 spectrograph2)
	(supports instrument2 image4)
	(supports instrument2 image6)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon9)
)
(:goal (and
	(have_image Planet5 spectrograph5)
	(have_image Planet5 spectrograph0)
	(have_image Star6 image6)
	(have_image Star6 spectrograph2)
	(have_image Star7 spectrograph0)
	(have_image Star7 image6)
	(have_image Star8 image4)
	(have_image Phenomenon9 thermograph7)
))

)

; plan
1. (turn_to satellite1 groundstation2 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 8
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 8
3. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 0 of 8
4. (turn_to satellite1 star6 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star6)
   goals met: 0 of 8
5. (turn_to satellite0 groundstation2 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 8
6. (take_image satellite1 star6 instrument2 image6)
   added: (have_image star6 image6)
   goals met: 1 of 8
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
8. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 8
9. (take_image satellite1 star6 instrument2 spectrograph2)
   added: (have_image star6 spectrograph2)
   goals met: 2 of 8
10. (turn_to satellite0 phenomenon9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 8
11. (take_image satellite0 phenomenon9 instrument0 thermograph7)
   added: (have_image phenomenon9 thermograph7)
   goals met: 3 of 8
12. (turn_to satellite0 planet5 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet5)
   goals met: 3 of 8
13. (take_image satellite0 planet5 instrument0 spectrograph0)
   added: (have_image planet5 spectrograph0)
   goals met: 4 of 8
14. (take_image satellite0 planet5 instrument0 spectrograph5)
   added: (have_image planet5 spectrograph5)
   goals met: 5 of 8
15. (turn_to satellite0 star7 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star7)
   goals met: 5 of 8
16. (take_image satellite0 star7 instrument0 spectrograph0)
   added: (have_image star7 spectrograph0)
   goals met: 6 of 8
17. (turn_to satellite1 star7 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star7)
   goals met: 6 of 8
18. (take_image satellite1 star7 instrument2 image6)
   added: (have_image star7 image6)
   goals met: 7 of 8
19. (turn_to satellite1 star8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star8)
   goals met: 7 of 8
20. (take_image satellite1 star8 instrument2 image4)
   added: (have_image star8 image4)
   goals met: 8 of 8
